requests/getTypeInfo.xml

<?xml version="1.0" encoding="UTF-8" ?>
<soap:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.e-controlnet.de/services/vii/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetTypeInfo>
      <AnlageId>
        <![CDATA[{anlageId}]]>
      </AnlageId>
      <GeraetId>
        <![CDATA[{geraetId}]]>
      </GeraetId>
    </GetTypeInfo>
  </soap:Body>
</soap:Envelope>
